var express = require('express');
var router = express.Router();

var sellers =   [{
  serviceID: 20,
  name: '云家政',
  avatar: 'http://img.daoway.cn/img/2015/10/13/e493da54-adaf-4bfc-90b7-3001b21b6a34.jpg',
  describe: {
    companyName: '上海家谐网络科技有限公司',
    text: '云家政是家政服务在线预订平台。我们的目标是让每个家庭都能获得诚信、便捷、有保障的家政服务。云家政拥有国内最大的实名认证家庭服务员数据库，目前平台上有超过100000名专业服务人员；数百个家政服务商，遍布全国主要城市各个社区。云家政倡导简单、轻松的生活方式。通过把分散的家政服务能力汇集和分配，让中国家庭获得诚信、便捷、有保障的家政服务，解决日常生活中的麻烦事，把更多时间留给自己和家人，提高生活品质'
  },
  sellCount: 22732,
  receiveCount: 94,
  positiveComment: 87,
  serveTime: {
    start: '08:00',
    end: '18:00',
    free: '04/27/12:30'
  },
  // 用于生成二维码的网址
  wechat: 'www.yunjiazheng.com',
  wechatUrl: 'http://www.daoway.cn/pcimages/daowayApp.png',
  cities:["北京","上海","广州","郑州","济南","西安","成都","南京","苏州","长沙","合肥","福州","重庆","厦门","青岛","南昌","石家庄","无锡","沈阳","徐州","温州","佛山","南通","深圳","武汉","宁波","杭州","天津"],
  serviceList: [
    {
      serveType: 1,
      class: '家庭保洁',
      type: '家庭保洁',
      name: '家庭保洁',
      price: 25,
      oldPrice: 50,
      avatar: 'http://img.daoway.cn/img/2017/03/22/83a8ce32-cb8e-4256-9059-377b9a7391b3.jpg',
      sellCount: 22222,
      wechat: 'www.yunjiazheng.com/baojie',
      wechatUrl: 'http://www.daoway.cn/pcimages/daowayApp.png',
      serveDesribe: {
        text: '服务内容：<br>1.家庭保洁服务，2小时起订，服务商携带清洁装备，包含清洁毛巾、清洁剂、百洁布、钢丝球、专业铲刀、毛刷。<br>2.超时请补差价，按小时工的售卖价格收取，超过不足半小时按半小时算，不足一小时按一小时算，请在订单详情中点击补差价操作。<br><br>服务保障：<br>1.根据满意度提交评价。<br>2.清洁内容丰富，专注卫生死角。<br>3.价格透明不现场加价。<br>4.服务标准化，品质可预见。<br>5.发现怠工，随即终止服务，联系我们为您处理，直到满意为止。<br>6.出现服务质量问题，免费返工。<br>7.19年品牌，自营技师，我们不外包。<br><br>服务范围：<br>（超出服务范围的服务要求可与现场工人沟通）<br>客餐厅：电视柜、茶几、门、桌面、垃圾桶、地面、其他<br>卧室和衣帽间：阳台扶手栏、开关、窗槽、窗台、其他<br>书房和储物间：窗台、桌面、书柜、垃圾桶、地面、其他<br>厨房：抽油烟机表面、橱柜、洗菜池、台面、垃圾桶、地面、其他<br>卫生间：洗漱台、沐浴房、马桶、垃圾桶、地面、其他<br>阳台和露天：阳台扶手栏、开关、窗槽、窗台、其他及其他做到无杂物，无污渍。',
        promise: '1.商家将在您下单后30分钟内确认接单；<br>2.订单确认后，修改订单或退款需提前2小时通知；<br>3.预约时间前2小时内退单将按30元/人扣取误工费；<br>4.如商家接单后爽约将全额退款并向您额外赔付30元；<br>5.为保障您的权益，所有费用请通过到位平台支付。',
        detail: ['（可以在购买时间内自由安排服务项目，超出服务范围的服务要求可以现场与工人沟通）','1.客餐厅：电视柜、茶几、桌面、门、餐桌、垃圾桶、沙发下、地面、卫生死角。', '2.卧室和阳台：阳台扶手、开关、插座、及其他。', '3.书房和储物间：桌面、书柜、垃圾桶、地面、卫生死角及其他。', '4.厨房：抽油烟机表面、橱柜、洗菜池、台面、地面、垃圾桶及其他。', '5.卫生间：洗漱台、沐浴房、马桶、垃圾桶、地面及其他。']
      }
    }
  ]
}]

var serviceList = [
  {
    className: '家庭保洁',
    classType:1,
    serves: [
      {
        serviceID: 10,
        class: 1,// 对应banner导航一级菜单 家庭保洁
        type: '小时工',  // 对应二级菜单  小时工
        name: '家庭保洁', // 对应选项卡名
        price: 25,
        oldPrice: 50,
        avatar: 'http://img.daoway.cn/img/2017/03/22/83a8ce32-cb8e-4256-9059-377b9a7391b3.jpg',
        sellCount: 22222,
        wechat: 'www.yunjiazheng.com/baojie',
        wechatUrl: 'http://www.daoway.cn/pcimages/daowayApp.png',
        serveDesribe: {
          text: '服务内容：\n1.家庭保洁服务，2小时起订，服务商携带清洁装备，包含清洁毛巾、清洁剂、百洁布、钢丝球、专业铲刀、毛刷。\n2.超时请补差价，按小时工的售卖价格收取，超过不足半小时按半小时算，不足一小时按一小时算，请在订单详情中点击补差价操作。\n\n服务保障：\n1.根据满意度提交评价。\n2.清洁内容丰富，专注卫生死角。\n3.价格透明不现场加价。\n4.服务标准化，品质可预见。\n5.发现怠工，随即终止服务，联系我们为您处理，直到满意为止。\n6.出现服务质量问题，免费返工。\n7.19年品牌，自营技师，我们不外包。\n\n服务范围：\n（超出服务范围的服务要求可与现场工人沟通）\n客餐厅：电视柜、茶几、门、桌面、垃圾桶、地面、其他\n卧室和衣帽间：阳台扶手栏、开关、窗槽、窗台、其他\n书房和储物间：窗台、桌面、书柜、垃圾桶、地面、其他\n厨房：抽油烟机表面、橱柜、洗菜池、台面、垃圾桶、地面、其他\n卫生间：洗漱台、沐浴房、马桶、垃圾桶、地面、其他\n阳台和露天：阳台扶手栏、开关、窗槽、窗台、其他及其他做到无杂物，无污渍。',
          promise: '1.商家将在您下单后30分钟内确认接单；\n2.订单确认后，修改订单或退款需提前2小时通知；\n3.预约时间前2小时内退单将按30元/人扣取误工费；\n4.如商家接单后爽约将全额退款并向您额外赔付30元；\n5.为保障您的权益，所有费用请通过到位平台支付。',
        },
        fater: null
      },
      {
        serviceID: 10,
        class: 1,// 对应banner导航一级菜单 家庭保洁
        type: '小时工',  // 对应二级菜单  小时工
        name: '家庭保洁', // 对应选项卡名
        price: 25,
        oldPrice: 50,
        avatar: 'http://img.daoway.cn/img/2016/12/28/804b76df-df07-4eed-8cec-2593348f3784_thumb.jpg',
        sellCount: 22222,
        wechat: 'www.yunjiazheng.com/baojie',
        wechatUrl: 'http://www.daoway.cn/pcimages/daowayApp.png',
        serveDesribe: {
          text: '服务内容：\n1.家庭保洁服务，2小时起订，服务商携带清洁装备，包含清洁毛巾、清洁剂、百洁布、钢丝球、专业铲刀、毛刷。\n2.超时请补差价，按小时工的售卖价格收取，超过不足半小时按半小时算，不足一小时按一小时算，请在订单详情中点击补差价操作。\n\n服务保障：\n1.根据满意度提交评价。\n2.清洁内容丰富，专注卫生死角。\n3.价格透明不现场加价。\n4.服务标准化，品质可预见。\n5.发现怠工，随即终止服务，联系我们为您处理，直到满意为止。\n6.出现服务质量问题，免费返工。\n7.19年品牌，自营技师，我们不外包。\n\n服务范围：\n（超出服务范围的服务要求可与现场工人沟通）\n客餐厅：电视柜、茶几、门、桌面、垃圾桶、地面、其他\n卧室和衣帽间：阳台扶手栏、开关、窗槽、窗台、其他\n书房和储物间：窗台、桌面、书柜、垃圾桶、地面、其他\n厨房：抽油烟机表面、橱柜、洗菜池、台面、垃圾桶、地面、其他\n卫生间：洗漱台、沐浴房、马桶、垃圾桶、地面、其他\n阳台和露天：阳台扶手栏、开关、窗槽、窗台、其他及其他做到无杂物，无污渍。',
          promise: '1.商家将在您下单后30分钟内确认接单；\n2.订单确认后，修改订单或退款需提前2小时通知；\n3.预约时间前2小时内退单将按30元/人扣取误工费；\n4.如商家接单后爽约将全额退款并向您额外赔付30元；\n5.为保障您的权益，所有费用请通过到位平台支付。',
        },
        fater: null
      },
      {
        serviceID: 10,
        class: 1,// 对应banner导航一级菜单 家庭保洁
        type: '小时工',  // 对应二级菜单  小时工
        name: '家庭保洁', // 对应选项卡名
        price: 30,
        oldPrice: 50,
        avatar: 'http://img.daoway.cn/img/2016/12/13/8c3823a3-922c-4d4e-a239-40ccbfd3fc46_thumb.jpg',
        sellCount: 22222,
        wechat: 'www.yunjiazheng.com/baojie',
        wechatUrl: 'http://www.daoway.cn/pcimages/daowayApp.png',
        serveDesribe: {
          text: '服务内容：\n1.家庭保洁服务，2小时起订，服务商携带清洁装备，包含清洁毛巾、清洁剂、百洁布、钢丝球、专业铲刀、毛刷。\n2.超时请补差价，按小时工的售卖价格收取，超过不足半小时按半小时算，不足一小时按一小时算，请在订单详情中点击补差价操作。\n\n服务保障：\n1.根据满意度提交评价。\n2.清洁内容丰富，专注卫生死角。\n3.价格透明不现场加价。\n4.服务标准化，品质可预见。\n5.发现怠工，随即终止服务，联系我们为您处理，直到满意为止。\n6.出现服务质量问题，免费返工。\n7.19年品牌，自营技师，我们不外包。\n\n服务范围：\n（超出服务范围的服务要求可与现场工人沟通）\n客餐厅：电视柜、茶几、门、桌面、垃圾桶、地面、其他\n卧室和衣帽间：阳台扶手栏、开关、窗槽、窗台、其他\n书房和储物间：窗台、桌面、书柜、垃圾桶、地面、其他\n厨房：抽油烟机表面、橱柜、洗菜池、台面、垃圾桶、地面、其他\n卫生间：洗漱台、沐浴房、马桶、垃圾桶、地面、其他\n阳台和露天：阳台扶手栏、开关、窗槽、窗台、其他及其他做到无杂物，无污渍。',
          promise: '1.商家将在您下单后30分钟内确认接单；\n2.订单确认后，修改订单或退款需提前2小时通知；\n3.预约时间前2小时内退单将按30元/人扣取误工费；\n4.如商家接单后爽约将全额退款并向您额外赔付30元；\n5.为保障您的权益，所有费用请通过到位平台支付。',
        },
        fater: null
      },
      {
        serviceID: 10,
        class: 1,// 对应banner导航一级菜单 家庭保洁
        type: '小时工',  // 对应二级菜单  小时工
        name: '家庭保洁', // 对应选项卡名
        price: 25,
        oldPrice: 50,
        avatar: 'http://img.daoway.cn/img/2016/12/19/a71fcfd6-a2b3-43e2-82ea-c1ac4c6150f9_thumb.jpg',
        sellCount: 22222,
        wechat: 'www.yunjiazheng.com/baojie',
        wechatUrl: 'http://www.daoway.cn/pcimages/daowayApp.png',
        serveDesribe: {
          text: '服务内容：\n1.家庭保洁服务，2小时起订，服务商携带清洁装备，包含清洁毛巾、清洁剂、百洁布、钢丝球、专业铲刀、毛刷。\n2.超时请补差价，按小时工的售卖价格收取，超过不足半小时按半小时算，不足一小时按一小时算，请在订单详情中点击补差价操作。\n\n服务保障：\n1.根据满意度提交评价。\n2.清洁内容丰富，专注卫生死角。\n3.价格透明不现场加价。\n4.服务标准化，品质可预见。\n5.发现怠工，随即终止服务，联系我们为您处理，直到满意为止。\n6.出现服务质量问题，免费返工。\n7.19年品牌，自营技师，我们不外包。\n\n服务范围：\n（超出服务范围的服务要求可与现场工人沟通）\n客餐厅：电视柜、茶几、门、桌面、垃圾桶、地面、其他\n卧室和衣帽间：阳台扶手栏、开关、窗槽、窗台、其他\n书房和储物间：窗台、桌面、书柜、垃圾桶、地面、其他\n厨房：抽油烟机表面、橱柜、洗菜池、台面、垃圾桶、地面、其他\n卫生间：洗漱台、沐浴房、马桶、垃圾桶、地面、其他\n阳台和露天：阳台扶手栏、开关、窗槽、窗台、其他及其他做到无杂物，无污渍。',
          promise: '1.商家将在您下单后30分钟内确认接单；\n2.订单确认后，修改订单或退款需提前2小时通知；\n3.预约时间前2小时内退单将按30元/人扣取误工费；\n4.如商家接单后爽约将全额退款并向您额外赔付30元；\n5.为保障您的权益，所有费用请通过到位平台支付。',
        },
        fater: null
      },
      {
        serviceID: 10,
        class: 1,// 对应banner导航一级菜单 家庭保洁
        type: '小时工',  // 对应二级菜单  小时工
        name: '家庭保洁', // 对应选项卡名
        price: 25,
        oldPrice: 50,
        avatar: 'http://img.daoway.cn/img/2016/08/29/6d7d4729-297b-4625-b903-f5e9276d926d_thumb.jpg',
        sellCount: 22222,
        wechat: 'www.yunjiazheng.com/baojie',
        wechatUrl: 'http://www.daoway.cn/pcimages/daowayApp.png',
        serveDesribe: {
          text: '服务内容：\n1.家庭保洁服务，2小时起订，服务商携带清洁装备，包含清洁毛巾、清洁剂、百洁布、钢丝球、专业铲刀、毛刷。\n2.超时请补差价，按小时工的售卖价格收取，超过不足半小时按半小时算，不足一小时按一小时算，请在订单详情中点击补差价操作。\n\n服务保障：\n1.根据满意度提交评价。\n2.清洁内容丰富，专注卫生死角。\n3.价格透明不现场加价。\n4.服务标准化，品质可预见。\n5.发现怠工，随即终止服务，联系我们为您处理，直到满意为止。\n6.出现服务质量问题，免费返工。\n7.19年品牌，自营技师，我们不外包。\n\n服务范围：\n（超出服务范围的服务要求可与现场工人沟通）\n客餐厅：电视柜、茶几、门、桌面、垃圾桶、地面、其他\n卧室和衣帽间：阳台扶手栏、开关、窗槽、窗台、其他\n书房和储物间：窗台、桌面、书柜、垃圾桶、地面、其他\n厨房：抽油烟机表面、橱柜、洗菜池、台面、垃圾桶、地面、其他\n卫生间：洗漱台、沐浴房、马桶、垃圾桶、地面、其他\n阳台和露天：阳台扶手栏、开关、窗槽、窗台、其他及其他做到无杂物，无污渍。',
          promise: '1.商家将在您下单后30分钟内确认接单；\n2.订单确认后，修改订单或退款需提前2小时通知；\n3.预约时间前2小时内退单将按30元/人扣取误工费；\n4.如商家接单后爽约将全额退款并向您额外赔付30元；\n5.为保障您的权益，所有费用请通过到位平台支付。',
        },
        fater: null
      }],},
  {
    className: '上门按摩',
    classType:2,
    serves: [
      {
        serviceID: 20,
        class: 2,// 对应banner导航一级菜单 上门按摩
        type: '中医推拿',  // 对应二级菜单  小时工
        name: '全身推拿', // 对应选项卡名
        price: 125,
        oldPrice: 156,
        avatar: 'http://img.daoway.cn/img/2016/08/29/a42e06d1-d4be-434d-baa2-81d81dde0ad5_thumb.jpg',
        sellCount: 22222,
        wechat: 'www.yunjiazheng.com/baojie',
        wechatUrl: 'http://www.daoway.cn/pcimages/daowayApp.png',
        serveDesribe: {
          text: '时长：60分钟\n服务姿势：卧姿\n\n适用介绍：\n适用机关工作、白领人士和上班一族由于工作压力大，缺乏锻炼或经常熬夜所致的疲乏、眼干涩、皮肤松弛，腰酸背痛等人群。\n\n不宜人群：\n高龄者不宜；高血压、心脏病患者不宜；骨折不宜；孕妇、哺乳期、经期不宜。\n\n功效介绍：\n应用宜生到家中医外治法之按摩手法，可快速缓解肌肉劳损，缓解疲劳，疏通经络、放松精神、改善气血运行，保持机体的阴阳平衡，提高人体的整体免疫能力，预防疾病，为身体增添活力。同时还可以改善睡眠质量。\n\n理疗流程：\n问诊-体诊-诊断-制定方案-运用宜生源中医外治法头部、上肢、胸腹部、颈部、背腰部、下肢部进行健康调理。\n\n用品提供：\n一次性塑封袋内装：口罩1个、轻薄床单1张、按摩巾1张。',
          promise: '1.本店下单时可在线选择技师，每单只能订购1份服务，如需同时订多项服务请分成多个订单；\n2.订单确认后，如需更改时间需提前4小时通知；\n3.预约时间前2小时内退单将扣除30元爽约金；技师到达后等待超过30分钟因顾客原因未能服务将扣除订单金额的50%；\n4.因夜间技师往返交通不便，需要客户负担打车费用，22点（含）以后结束的订单50元，22点（含）以后开始服务的订单100元。',
        },
        fater: null
      },
      {
        serviceID: 20,
        class: 2,// 对应banner导航一级菜单 上门按摩
        type: '中医推拿',  // 对应二级菜单  小时工
        name: '全身推拿', // 对应选项卡名
        price: 125,
        oldPrice: 156,
        avatar: 'http://img.daoway.cn/img/2016/10/12/3d8cd401-13f8-4e01-92dc-5dfc6dbd4d37_thumb.jpg',
        sellCount: 22222,
        wechat: 'www.yunjiazheng.com/baojie',
        wechatUrl: 'http://www.daoway.cn/pcimages/daowayApp.png',
        serveDesribe: {
          text: '时长：60分钟\n服务姿势：卧姿\n\n适用介绍：\n适用机关工作、白领人士和上班一族由于工作压力大，缺乏锻炼或经常熬夜所致的疲乏、眼干涩、皮肤松弛，腰酸背痛等人群。\n\n不宜人群：\n高龄者不宜；高血压、心脏病患者不宜；骨折不宜；孕妇、哺乳期、经期不宜。\n\n功效介绍：\n应用宜生到家中医外治法之按摩手法，可快速缓解肌肉劳损，缓解疲劳，疏通经络、放松精神、改善气血运行，保持机体的阴阳平衡，提高人体的整体免疫能力，预防疾病，为身体增添活力。同时还可以改善睡眠质量。\n\n理疗流程：\n问诊-体诊-诊断-制定方案-运用宜生源中医外治法头部、上肢、胸腹部、颈部、背腰部、下肢部进行健康调理。\n\n用品提供：\n一次性塑封袋内装：口罩1个、轻薄床单1张、按摩巾1张。',
          promise: '1.本店下单时可在线选择技师，每单只能订购1份服务，如需同时订多项服务请分成多个订单；\n2.订单确认后，如需更改时间需提前4小时通知；\n3.预约时间前2小时内退单将扣除30元爽约金；技师到达后等待超过30分钟因顾客原因未能服务将扣除订单金额的50%；\n4.因夜间技师往返交通不便，需要客户负担打车费用，22点（含）以后结束的订单50元，22点（含）以后开始服务的订单100元。',
        },
        fater: null
      },
      {
        serviceID: 20,
        class: 2,// 对应banner导航一级菜单 上门按摩
        type: '中医推拿',  // 对应二级菜单  小时工
        name: '全身推拿', // 对应选项卡名
        price: 125,
        oldPrice: 156,
        avatar: 'http://img.daoway.cn/img/2016/09/27/576812a3-6c36-49c7-9fbc-2c4890c8774e_thumb.jpg',
        sellCount: 22222,
        wechat: 'www.yunjiazheng.com/baojie',
        wechatUrl: 'http://www.daoway.cn/pcimages/daowayApp.png',
        serveDesribe: {
          text: '时长：60分钟\n服务姿势：卧姿\n\n适用介绍：\n适用机关工作、白领人士和上班一族由于工作压力大，缺乏锻炼或经常熬夜所致的疲乏、眼干涩、皮肤松弛，腰酸背痛等人群。\n\n不宜人群：\n高龄者不宜；高血压、心脏病患者不宜；骨折不宜；孕妇、哺乳期、经期不宜。\n\n功效介绍：\n应用宜生到家中医外治法之按摩手法，可快速缓解肌肉劳损，缓解疲劳，疏通经络、放松精神、改善气血运行，保持机体的阴阳平衡，提高人体的整体免疫能力，预防疾病，为身体增添活力。同时还可以改善睡眠质量。\n\n理疗流程：\n问诊-体诊-诊断-制定方案-运用宜生源中医外治法头部、上肢、胸腹部、颈部、背腰部、下肢部进行健康调理。\n\n用品提供：\n一次性塑封袋内装：口罩1个、轻薄床单1张、按摩巾1张。',
          promise: '1.本店下单时可在线选择技师，每单只能订购1份服务，如需同时订多项服务请分成多个订单；\n2.订单确认后，如需更改时间需提前4小时通知；\n3.预约时间前2小时内退单将扣除30元爽约金；技师到达后等待超过30分钟因顾客原因未能服务将扣除订单金额的50%；\n4.因夜间技师往返交通不便，需要客户负担打车费用，22点（含）以后结束的订单50元，22点（含）以后开始服务的订单100元。',
        },
        fater: null
      },
      {
        serviceID: 20,
        class: 2,// 对应banner导航一级菜单 上门按摩
        type: '中医推拿',  // 对应二级菜单  小时工
        name: '全身推拿', // 对应选项卡名
        price: 125,
        oldPrice: 156,
        avatar: 'http://img.daoway.cn/img/2016/04/12/04e8bf0b-b3a9-4edf-8cba-dbbb6bd23fa3_thumb.jpg',
        sellCount: 22222,
        wechat: 'www.yunjiazheng.com/baojie',
        wechatUrl: 'http://www.daoway.cn/pcimages/daowayApp.png',
        serveDesribe: {
          text: '时长：60分钟\n服务姿势：卧姿\n\n适用介绍：\n适用机关工作、白领人士和上班一族由于工作压力大，缺乏锻炼或经常熬夜所致的疲乏、眼干涩、皮肤松弛，腰酸背痛等人群。\n\n不宜人群：\n高龄者不宜；高血压、心脏病患者不宜；骨折不宜；孕妇、哺乳期、经期不宜。\n\n功效介绍：\n应用宜生到家中医外治法之按摩手法，可快速缓解肌肉劳损，缓解疲劳，疏通经络、放松精神、改善气血运行，保持机体的阴阳平衡，提高人体的整体免疫能力，预防疾病，为身体增添活力。同时还可以改善睡眠质量。\n\n理疗流程：\n问诊-体诊-诊断-制定方案-运用宜生源中医外治法头部、上肢、胸腹部、颈部、背腰部、下肢部进行健康调理。\n\n用品提供：\n一次性塑封袋内装：口罩1个、轻薄床单1张、按摩巾1张。',
          promise: '1.本店下单时可在线选择技师，每单只能订购1份服务，如需同时订多项服务请分成多个订单；\n2.订单确认后，如需更改时间需提前4小时通知；\n3.预约时间前2小时内退单将扣除30元爽约金；技师到达后等待超过30分钟因顾客原因未能服务将扣除订单金额的50%；\n4.因夜间技师往返交通不便，需要客户负担打车费用，22点（含）以后结束的订单50元，22点（含）以后开始服务的订单100元。',
        },
        fater: null
      },
      {
        serviceID: 20,
        class: 2,// 对应banner导航一级菜单 上门按摩
        type: '中医推拿',  // 对应二级菜单  小时工
        name: '臀部系统护理', // 对应选项卡名
        price: 125,
        oldPrice: 156,
        avatar: 'http://img.daoway.cn/img/2017/03/09/d3027d25-2061-46af-91ff-c56a64bdd3ad_thumb.jpg',
        sellCount: 22222,
        wechat: 'www.yunjiazheng.com/baojie',
        wechatUrl: 'http://www.daoway.cn/pcimages/daowayApp.png',
        serveDesribe: {
          text: '时长：60分钟\n服务姿势：卧姿\n\n适用介绍：\n适用机关工作、白领人士和上班一族由于工作压力大，缺乏锻炼或经常熬夜所致的疲乏、眼干涩、皮肤松弛，腰酸背痛等人群。\n\n不宜人群：\n高龄者不宜；高血压、心脏病患者不宜；骨折不宜；孕妇、哺乳期、经期不宜。\n\n功效介绍：\n应用宜生到家中医外治法之按摩手法，可快速缓解肌肉劳损，缓解疲劳，疏通经络、放松精神、改善气血运行，保持机体的阴阳平衡，提高人体的整体免疫能力，预防疾病，为身体增添活力。同时还可以改善睡眠质量。\n\n理疗流程：\n问诊-体诊-诊断-制定方案-运用宜生源中医外治法头部、上肢、胸腹部、颈部、背腰部、下肢部进行健康调理。\n\n用品提供：\n一次性塑封袋内装：口罩1个、轻薄床单1张、按摩巾1张。',
          promise: '1.本店下单时可在线选择技师，每单只能订购1份服务，如需同时订多项服务请分成多个订单；\n2.订单确认后，如需更改时间需提前4小时通知；\n3.预约时间前2小时内退单将扣除30元爽约金；技师到达后等待超过30分钟因顾客原因未能服务将扣除订单金额的50%；\n4.因夜间技师往返交通不便，需要客户负担打车费用，22点（含）以后结束的订单50元，22点（含）以后开始服务的订单100元。',
        },
        fater: null
      },],},
  {
    className: '上门维修',
    classType:3,
    serves: [
      {
        serviceID: 30,
        class: 3,// 对应banner导航一级菜单 上门维修
        type: '家装装修',  // 对应二级菜单  家装装修
        name: '换窗纱', // 对应选项卡名
        price: 125,
        oldPrice: 156,
        avatar: 'http://img.daoway.cn/img/2016/09/02/9511ffa1-2852-4294-be4b-821e754b0238_thumb.jpg',
        sellCount: 22222,
        wechat: 'www.yunjiazheng.com/baojie',
        wechatUrl: 'http://www.daoway.cn/pcimages/daowayApp.png',
        serveDesribe: {
          text: '服务内容：\n 此项服务包含窗纱费用和人工更换费用\n\n服务保障：\n1.师傅所提供配件质保3个月（用户使用不当及人为损坏均不在保修范围内）\n 2.本店所有服务明码标价，无上门费等任何附加费用，请放心选购',
          promise: '1.商家将在您下单后30分钟内确认接单；\n2.订单确认后，修改订单或退款需提前2小时通知；\n3.预约时间前2小时内退单将按30元/人扣取误工费；\n4.如商家接单后爽约将全额退款并向您额外赔付30元；\n5.为保障您的权益，所有费用请通过到位平台支付。',
        },
        fater: null
      },
      {
        serviceID: 30,
        class: 3,// 对应banner导航一级菜单 上门维修
        type: '家装装修',  // 对应二级菜单  家装装修
        name: '换窗纱', // 对应选项卡名
        price: 125,
        oldPrice: 156,
        avatar: 'http://img.daoway.cn/img/2017/04/20/2c64892e-d550-45e3-93cc-8f44c6e05c9d_thumb.jpg',
        sellCount: 22222,
        wechat: 'www.yunjiazheng.com/baojie',
        wechatUrl: 'http://www.daoway.cn/pcimages/daowayApp.png',
        serveDesribe: {
          text: '服务内容：\n 此项服务包含窗纱费用和人工更换费用\n\n服务保障：\n1.师傅所提供配件质保3个月（用户使用不当及人为损坏均不在保修范围内）\n 2.本店所有服务明码标价，无上门费等任何附加费用，请放心选购',
          promise: '1.商家将在您下单后30分钟内确认接单；\n2.订单确认后，修改订单或退款需提前2小时通知；\n3.预约时间前2小时内退单将按30元/人扣取误工费；\n4.如商家接单后爽约将全额退款并向您额外赔付30元；\n5.为保障您的权益，所有费用请通过到位平台支付。',
        },
        fater: null
      },
      {
        serviceID: 30,
        class: 3,// 对应banner导航一级菜单 上门维修
        type: '家装装修',  // 对应二级菜单  家装装修
        name: '换窗纱', // 对应选项卡名
        price: 125,
        oldPrice: 156,
        avatar: 'http://img.daoway.cn/img/2016/06/29/6646d330-6ce4-46ae-a08a-ff28f67a06e2_thumb.jpg',
        sellCount: 22222,
        wechat: 'www.yunjiazheng.com/baojie',
        wechatUrl: 'http://www.daoway.cn/pcimages/daowayApp.png',
        serveDesribe: {
          text: '服务内容：\n 此项服务包含窗纱费用和人工更换费用\n\n服务保障：\n1.师傅所提供配件质保3个月（用户使用不当及人为损坏均不在保修范围内）\n 2.本店所有服务明码标价，无上门费等任何附加费用，请放心选购',
          promise: '1.商家将在您下单后30分钟内确认接单；\n2.订单确认后，修改订单或退款需提前2小时通知；\n3.预约时间前2小时内退单将按30元/人扣取误工费；\n4.如商家接单后爽约将全额退款并向您额外赔付30元；\n5.为保障您的权益，所有费用请通过到位平台支付。',
        },
        fater: null
      },
      {
        serviceID: 30,
        class: 3,// 对应banner导航一级菜单 上门维修
        type: '家装装修',  // 对应二级菜单  家装装修
        name: '换窗纱', // 对应选项卡名
        price: 125,
        oldPrice: 156,
        avatar: 'http://img.daoway.cn/img/2016/06/13/de7dc672-2589-454e-85c2-81458f630a27_thumb.jpg',
        sellCount: 22222,
        wechat: 'www.yunjiazheng.com/baojie',
        wechatUrl: 'http://www.daoway.cn/pcimages/daowayApp.png',
        serveDesribe: {
          text: '服务内容：\n 此项服务包含窗纱费用和人工更换费用\n\n服务保障：\n1.师傅所提供配件质保3个月（用户使用不当及人为损坏均不在保修范围内）\n 2.本店所有服务明码标价，无上门费等任何附加费用，请放心选购',
          promise: '1.商家将在您下单后30分钟内确认接单；\n2.订单确认后，修改订单或退款需提前2小时通知；\n3.预约时间前2小时内退单将按30元/人扣取误工费；\n4.如商家接单后爽约将全额退款并向您额外赔付30元；\n5.为保障您的权益，所有费用请通过到位平台支付。',
        },
        fater: null
      },
      {
        serviceID: 30,
        class: 3,// 对应banner导航一级菜单 上门维修
        type: '家装装修',  // 对应二级菜单  家装装修
        name: '换窗纱', // 对应选项卡名
        price: 125,
        oldPrice: 156,
        avatar: 'http://img.daoway.cn/img/2017/04/02/bacae70d-17d0-4bfa-b5eb-f54396e3c68e_thumb.jpg',
        sellCount: 22222,
        wechat: 'www.yunjiazheng.com/baojie',
        wechatUrl: 'http://www.daoway.cn/pcimages/daowayApp.png',
        serveDesribe: {
          text: '服务内容：\n 此项服务包含窗纱费用和人工更换费用\n\n服务保障：\n1.师傅所提供配件质保3个月（用户使用不当及人为损坏均不在保修范围内）\n 2.本店所有服务明码标价，无上门费等任何附加费用，请放心选购',
          promise: '1.商家将在您下单后30分钟内确认接单；\n2.订单确认后，修改订单或退款需提前2小时通知；\n3.预约时间前2小时内退单将按30元/人扣取误工费；\n4.如商家接单后爽约将全额退款并向您额外赔付30元；\n5.为保障您的权益，所有费用请通过到位平台支付。',
        },
        fater: null
      },],},
  {
    className: '家电清洗',
    classType:4,
    serves: [
      {
        serviceID: 40, // 对应服务提供商
        class: 4,// 对应banner导航一级菜单 家电清洗
        type: '空调清洗',  // 对应二级菜单  空调清洗
        name: '挂机空调清洗', // 对应选项卡名
        price: 125,
        oldPrice: 156,
        avatar: 'http://img.daoway.cn/img/2017/04/20/2c64892e-d550-45e3-93cc-8f44c6e05c9d_thumb.jpg',
        sellCount: 22222,
        wechat: 'www.yunjiazheng.com/baojie',
        wechatUrl: 'http://www.daoway.cn/pcimages/daowayApp.png',
        serveDesribe: {
          text: '清洗流程：\n1.入户卫生\n2.检验机器，准备工作\n3.拆卸机器，安防护罩\n4.清洁杀菌，清洗\n5.装机还原，试机\n6.清理现场\n\n温馨提醒：\n1.不清洗外机；\n2.如机器存在老化或损坏情况，不建议进行清洗服务；',
          promise: '1.订单确认后，如需更改时间需提前4小时通知。\n2.如需退订请提前4小时通知客服人员进行退款。\n3.工程师到达后因用户原因取消订单将扣除30元违约金。',
        },
        fater: null
      },
      {
        serviceID: 40, // 对应服务提供商
        class: 4,// 对应banner导航一级菜单 家电清洗
        type: '空调清洗',  // 对应二级菜单  空调清洗
        name: '挂机空调清洗', // 对应选项卡名
        price: 125,
        oldPrice: 156,
        avatar: 'http://img.daoway.cn/img/2016/07/01/d1dbf0a0-ba87-4847-9978-21567461e2f9_thumb.jpg',
        sellCount: 22222,
        wechat: 'www.yunjiazheng.com/baojie',
        wechatUrl: 'http://www.daoway.cn/pcimages/daowayApp.png',
        serveDesribe: {
          text: '清洗流程：\n1.入户卫生\n2.检验机器，准备工作\n3.拆卸机器，安防护罩\n4.清洁杀菌，清洗\n5.装机还原，试机\n6.清理现场\n\n温馨提醒：\n1.不清洗外机；\n2.如机器存在老化或损坏情况，不建议进行清洗服务；',
          promise: '1.订单确认后，如需更改时间需提前4小时通知。\n2.如需退订请提前4小时通知客服人员进行退款。\n3.工程师到达后因用户原因取消订单将扣除30元违约金。',
        },
        fater: null
      },
      {
        serviceID: 40, // 对应服务提供商
        class: 4,// 对应banner导航一级菜单 家电清洗
        type: '空调清洗',  // 对应二级菜单  空调清洗
        name: '挂机空调清洗', // 对应选项卡名
        price: 125,
        oldPrice: 156,
        avatar: 'http://img.daoway.cn/img/2017/04/01/5d835280-e04f-4ad6-8784-ae9b86d5b90a_thumb.jpg',
        sellCount: 22222,
        wechat: 'www.yunjiazheng.com/baojie',
        wechatUrl: 'http://www.daoway.cn/pcimages/daowayApp.png',
        serveDesribe: {
          text: '清洗流程：\n1.入户卫生\n2.检验机器，准备工作\n3.拆卸机器，安防护罩\n4.清洁杀菌，清洗\n5.装机还原，试机\n6.清理现场\n\n温馨提醒：\n1.不清洗外机；\n2.如机器存在老化或损坏情况，不建议进行清洗服务；',
          promise: '1.订单确认后，如需更改时间需提前4小时通知。\n2.如需退订请提前4小时通知客服人员进行退款。\n3.工程师到达后因用户原因取消订单将扣除30元违约金。',
        },
        fater: null
      },
      {
        serviceID: 40, // 对应服务提供商
        class: 4,// 对应banner导航一级菜单 家电清洗
        type: '空调清洗',  // 对应二级菜单  空调清洗
        name: '挂机空调清洗', // 对应选项卡名
        price: 125,
        oldPrice: 156,
        avatar: 'http://img.daoway.cn/img/2017/03/25/123715ad-7973-4dd0-a8e6-09e9f146bf09_thumb.jpg',
        sellCount: 22222,
        wechat: 'www.yunjiazheng.com/baojie',
        wechatUrl: 'http://www.daoway.cn/pcimages/daowayApp.png',
        serveDesribe: {
          text: '清洗流程：\n1.入户卫生\n2.检验机器，准备工作\n3.拆卸机器，安防护罩\n4.清洁杀菌，清洗\n5.装机还原，试机\n6.清理现场\n\n温馨提醒：\n1.不清洗外机；\n2.如机器存在老化或损坏情况，不建议进行清洗服务；',
          promise: '1.订单确认后，如需更改时间需提前4小时通知。\n2.如需退订请提前4小时通知客服人员进行退款。\n3.工程师到达后因用户原因取消订单将扣除30元违约金。',
        },
        fater: null
      },
      {
        serviceID: 40, // 对应服务提供商
        class: 4,// 对应banner导航一级菜单 家电清洗
        type: '空调清洗',  // 对应二级菜单  空调清洗
        name: '挂机空调清洗', // 对应选项卡名
        price: 125,
        oldPrice: 156,
        avatar: 'http://img.daoway.cn/img/2017/04/01/d936e29a-60d2-4e1c-92ce-ef34cb0484f9_thumb.jpg',
        sellCount: 22222,
        wechat: 'www.yunjiazheng.com/baojie',
        wechatUrl: 'http://www.daoway.cn/pcimages/daowayApp.png',
        serveDesribe: {
          text: '清洗流程：\n1.入户卫生\n2.检验机器，准备工作\n3.拆卸机器，安防护罩\n4.清洁杀菌，清洗\n5.装机还原，试机\n6.清理现场\n\n温馨提醒：\n1.不清洗外机；\n2.如机器存在老化或损坏情况，不建议进行清洗服务；',
          promise: '1.订单确认后，如需更改时间需提前4小时通知。\n2.如需退订请提前4小时通知客服人员进行退款。\n3.工程师到达后因用户原因取消订单将扣除30元违约金。',
        },
        fater: null
      },],},
  {
    className: '衣物洗护',
    classType:5,
    serves: [
      {
        serviceID: 50, // 对应服务提供商
        class: 5,// 对应banner导航一级菜单 衣物洗护
        type: '上衣',  // 对应二级菜单  上衣
        name: '棉衣/羽绒服（长款）', // 对应选项卡名
        price: 125,
        oldPrice: 156,
        avatar: 'http://img.daoway.cn/img/2016/12/19/915d51ad-a07f-476a-aec4-fcfdb88a33f3_thumb.jpg',
        sellCount: 22222,
        wechat: 'www.yunjiazheng.com/baojie',
        wechatUrl: 'http://www.daoway.cn/pcimages/daowayApp.png',
        serveDesribe: {
          text: '服务内容：\n长款棉衣/羽绒服（衣物长度未超过臀部，视为短款。衣物长度超过臀部，视为长款）洗护周期为3-5天。\n\n服务保障：\n1、免费上门取送。\n2、标准化洗衣，可严格控制洗衣质量。\n3、出现服务质量问题，48小时内拨打客服电话，我们会在24小时内进行处理。\n\n服务流程：洗衣、消毒、熨烫、烘干。',
          promise: '1.商家将在您下单后30分钟内确认是否接单；\n2.订单确认后，修改订单或退款需提前2小时通知；\n3.预约时间前2小时内退单将按30元/人扣取空单费；\n4.如商家接单后爽约将全额退款并向您额外赔付30元；\n5.为保障您的权益，所有费用请通过到位平台支付；\n6.在小哥上门服务前,如需退款,可拨打客服电话咨询.如造成您的不便，敬请谅解。\n7.单笔开票金额或者累计开票金额达到200元及以上，本店将承担发票运费，免费为您邮寄发票。单笔开票金额低于200元，本店可开具发票，发票运费由您自行承担。详情咨询客服。',
        },
        fater: null
      },
      {
        serviceID: 50, // 对应服务提供商
        class: 5,// 对应banner导航一级菜单 衣物洗护
        type: '上衣',  // 对应二级菜单  上衣
        name: '棉衣/羽绒服（长款）', // 对应选项卡名
        price: 125,
        oldPrice: 156,
        avatar: 'http://img.daoway.cn/img/2016/12/28/28a4d43d-3c16-4388-9188-dc2855b331a7.jpg',
        sellCount: 22222,
        wechat: 'www.yunjiazheng.com/baojie',
        wechatUrl: 'http://www.daoway.cn/pcimages/daowayApp.png',
        serveDesribe: {
          text: '服务内容：\n长款棉衣/羽绒服（衣物长度未超过臀部，视为短款。衣物长度超过臀部，视为长款）洗护周期为3-5天。\n\n服务保障：\n1、免费上门取送。\n2、标准化洗衣，可严格控制洗衣质量。\n3、出现服务质量问题，48小时内拨打客服电话，我们会在24小时内进行处理。\n\n服务流程：洗衣、消毒、熨烫、烘干。',
          promise: '1.商家将在您下单后30分钟内确认是否接单；\n2.订单确认后，修改订单或退款需提前2小时通知；\n3.预约时间前2小时内退单将按30元/人扣取空单费；\n4.如商家接单后爽约将全额退款并向您额外赔付30元；\n5.为保障您的权益，所有费用请通过到位平台支付；\n6.在小哥上门服务前,如需退款,可拨打客服电话咨询.如造成您的不便，敬请谅解。\n7.单笔开票金额或者累计开票金额达到200元及以上，本店将承担发票运费，免费为您邮寄发票。单笔开票金额低于200元，本店可开具发票，发票运费由您自行承担。详情咨询客服。',
        },
        fater: null
      },
      {
        serviceID: 50, // 对应服务提供商
        class: 5,// 对应banner导航一级菜单 衣物洗护
        type: '上衣',  // 对应二级菜单  上衣
        name: '棉衣/羽绒服（长款）', // 对应选项卡名
        price: 125,
        oldPrice: 156,
        avatar: 'http://img.daoway.cn/img/2016/08/20/e272d596-391d-4d93-9298-817a58770637_thumb.jpg',
        sellCount: 22222,
        wechat: 'www.yunjiazheng.com/baojie',
        wechatUrl: 'http://www.daoway.cn/pcimages/daowayApp.png',
        serveDesribe: {
          text: '服务内容：\n长款棉衣/羽绒服（衣物长度未超过臀部，视为短款。衣物长度超过臀部，视为长款）洗护周期为3-5天。\n\n服务保障：\n1、免费上门取送。\n2、标准化洗衣，可严格控制洗衣质量。\n3、出现服务质量问题，48小时内拨打客服电话，我们会在24小时内进行处理。\n\n服务流程：洗衣、消毒、熨烫、烘干。',
          promise: '1.商家将在您下单后30分钟内确认是否接单；\n2.订单确认后，修改订单或退款需提前2小时通知；\n3.预约时间前2小时内退单将按30元/人扣取空单费；\n4.如商家接单后爽约将全额退款并向您额外赔付30元；\n5.为保障您的权益，所有费用请通过到位平台支付；\n6.在小哥上门服务前,如需退款,可拨打客服电话咨询.如造成您的不便，敬请谅解。\n7.单笔开票金额或者累计开票金额达到200元及以上，本店将承担发票运费，免费为您邮寄发票。单笔开票金额低于200元，本店可开具发票，发票运费由您自行承担。详情咨询客服。',
        },
        fater: null
      },
      {
        serviceID: 50, // 对应服务提供商
        class: 5,// 对应banner导航一级菜单 衣物洗护
        type: '上衣',  // 对应二级菜单  上衣
        name: '棉衣/羽绒服（长款）', // 对应选项卡名
        price: 125,
        oldPrice: 156,
        avatar: 'http://img.daoway.cn/img/2017/04/07/2fed1936-f5c0-4803-8f8f-709989adfe20_thumb.jpg',
        sellCount: 22222,
        wechat: 'www.yunjiazheng.com/baojie',
        wechatUrl: 'http://www.daoway.cn/pcimages/daowayApp.png',
        serveDesribe: {
          text: '服务内容：\n长款棉衣/羽绒服（衣物长度未超过臀部，视为短款。衣物长度超过臀部，视为长款）洗护周期为3-5天。\n\n服务保障：\n1、免费上门取送。\n2、标准化洗衣，可严格控制洗衣质量。\n3、出现服务质量问题，48小时内拨打客服电话，我们会在24小时内进行处理。\n\n服务流程：洗衣、消毒、熨烫、烘干。',
          promise: '1.商家将在您下单后30分钟内确认是否接单；\n2.订单确认后，修改订单或退款需提前2小时通知；\n3.预约时间前2小时内退单将按30元/人扣取空单费；\n4.如商家接单后爽约将全额退款并向您额外赔付30元；\n5.为保障您的权益，所有费用请通过到位平台支付；\n6.在小哥上门服务前,如需退款,可拨打客服电话咨询.如造成您的不便，敬请谅解。\n7.单笔开票金额或者累计开票金额达到200元及以上，本店将承担发票运费，免费为您邮寄发票。单笔开票金额低于200元，本店可开具发票，发票运费由您自行承担。详情咨询客服。',
        },
        fater: null
      },
      {
        serviceID: 50, // 对应服务提供商
        class: 5,// 对应banner导航一级菜单 衣物洗护
        type: '上衣',  // 对应二级菜单  上衣
        name: '棉衣/羽绒服（长款）', // 对应选项卡名
        price: 125,
        oldPrice: 156,
        avatar: 'http://img.daoway.cn/img/2016/12/22/8f7cabe1-5768-43af-8c04-1be4cb29fab3_thumb.jpg',
        sellCount: 22222,
        wechat: 'www.yunjiazheng.com/baojie',
        wechatUrl: 'http://www.daoway.cn/pcimages/daowayApp.png',
        serveDesribe: {
          text: '服务内容：\n长款棉衣/羽绒服（衣物长度未超过臀部，视为短款。衣物长度超过臀部，视为长款）洗护周期为3-5天。\n\n服务保障：\n1、免费上门取送。\n2、标准化洗衣，可严格控制洗衣质量。\n3、出现服务质量问题，48小时内拨打客服电话，我们会在24小时内进行处理。\n\n服务流程：洗衣、消毒、熨烫、烘干。',
          promise: '1.商家将在您下单后30分钟内确认是否接单；\n2.订单确认后，修改订单或退款需提前2小时通知；\n3.预约时间前2小时内退单将按30元/人扣取空单费；\n4.如商家接单后爽约将全额退款并向您额外赔付30元；\n5.为保障您的权益，所有费用请通过到位平台支付；\n6.在小哥上门服务前,如需退款,可拨打客服电话咨询.如造成您的不便，敬请谅解。\n7.单笔开票金额或者累计开票金额达到200元及以上，本店将承担发票运费，免费为您邮寄发票。单笔开票金额低于200元，本店可开具发票，发票运费由您自行承担。详情咨询客服。',
        },
        fater: null
      },],},
  {
    className: '搬家速运',
    classType: 6,
    serves: [
      {
        serviceID: 60, // 对应服务提供商
        class: 6,// 对应banner导航一级菜单 搬家速运
        type: '搬家套餐',  // 对应二级菜单  搬家套餐
        name: '厢货搬家', // 对应选项卡名
        price: 125,
        oldPrice: 156,
        avatar: 'http://img.daoway.cn/img/2017/03/23/612403f7-0b6f-4bbf-801b-e5ad6935660e.jpg',
        sellCount: 22222,
        wechat: 'www.yunjiazheng.com/baojie',
        wechatUrl: 'http://www.daoway.cn/pcimages/daowayApp.png',
        serveDesribe: {
          text: '服务内容：\n1.厢货车辆容积：4.2米*1.9米*1.9米=15.16立方，可装载个人物品和大中型家电；\n2.里程：包含10公里，超出后6元/公里\n3.搬运：有电梯免费搬运，无电梯楼层搬运按楼层阶梯式收费\n4.提供司机师傅2人独立搬运（包含电视、冰箱和洗衣机等免费搬运）\n5.拆装家具按照类别额外收费\n\n服务保障：\n7＊24小时全天候服务\n不满意全额退款',
          promise: '1.商家将在您下单后30分钟内确认接单；\n2.订单确认后，修改订单或退款需提前2小时通知；\n3.预约时间前2小时内退单将按30元/人扣取误工费；车辆到达后再退单将按100元/辆扣取空驶费；\n4.如商家接单后爽约将全额退款并向您额外赔付30元；\n5.为保障您的权益，所有费用请通过到位平台支付。',
        },
        fater: null
      },
      {
        serviceID: 60, // 对应服务提供商
        class: 6,// 对应banner导航一级菜单 搬家速运
        type: '搬家套餐',  // 对应二级菜单  搬家套餐
        name: '厢货搬家', // 对应选项卡名
        price: 125,
        oldPrice: 156,
        avatar: 'http://img.daoway.cn/img/2017/03/06/c725260a-5747-4f86-a4b1-8ab5574ed334_thumb.jpg',
        sellCount: 22222,
        wechat: 'www.yunjiazheng.com/baojie',
        wechatUrl: 'http://www.daoway.cn/pcimages/daowayApp.png',
        serveDesribe: {
          text: '服务内容：\n1.厢货车辆容积：4.2米*1.9米*1.9米=15.16立方，可装载个人物品和大中型家电；\n2.里程：包含10公里，超出后6元/公里\n3.搬运：有电梯免费搬运，无电梯楼层搬运按楼层阶梯式收费\n4.提供司机师傅2人独立搬运（包含电视、冰箱和洗衣机等免费搬运）\n5.拆装家具按照类别额外收费\n\n服务保障：\n7＊24小时全天候服务\n不满意全额退款',
          promise: '1.商家将在您下单后30分钟内确认接单；\n2.订单确认后，修改订单或退款需提前2小时通知；\n3.预约时间前2小时内退单将按30元/人扣取误工费；车辆到达后再退单将按100元/辆扣取空驶费；\n4.如商家接单后爽约将全额退款并向您额外赔付30元；\n5.为保障您的权益，所有费用请通过到位平台支付。',
        },
        fater: null
      },
      {
        serviceID: 60, // 对应服务提供商
        class: 6,// 对应banner导航一级菜单 搬家速运
        type: '搬家套餐',  // 对应二级菜单  搬家套餐
        name: '厢货搬家', // 对应选项卡名
        price: 125,
        oldPrice: 156,
        avatar: 'http://img.daoway.cn/img/2016/11/22/5ccea567-d796-4006-b5d2-731c55060964_thumb.jpg',
        sellCount: 22222,
        wechat: 'www.yunjiazheng.com/baojie',
        wechatUrl: 'http://www.daoway.cn/pcimages/daowayApp.png',
        serveDesribe: {
          text: '服务内容：\n1.厢货车辆容积：4.2米*1.9米*1.9米=15.16立方，可装载个人物品和大中型家电；\n2.里程：包含10公里，超出后6元/公里\n3.搬运：有电梯免费搬运，无电梯楼层搬运按楼层阶梯式收费\n4.提供司机师傅2人独立搬运（包含电视、冰箱和洗衣机等免费搬运）\n5.拆装家具按照类别额外收费\n\n服务保障：\n7＊24小时全天候服务\n不满意全额退款',
          promise: '1.商家将在您下单后30分钟内确认接单；\n2.订单确认后，修改订单或退款需提前2小时通知；\n3.预约时间前2小时内退单将按30元/人扣取误工费；车辆到达后再退单将按100元/辆扣取空驶费；\n4.如商家接单后爽约将全额退款并向您额外赔付30元；\n5.为保障您的权益，所有费用请通过到位平台支付。',
        },
        fater: null
      },
      {
        serviceID: 60, // 对应服务提供商
        class: 6,// 对应banner导航一级菜单 搬家速运
        type: '搬家套餐',  // 对应二级菜单  搬家套餐
        name: '厢货搬家', // 对应选项卡名
        price: 125,
        oldPrice: 156,
        avatar: 'http://img.daoway.cn/img/2017/04/07/60720281-1038-4e27-82b0-ce79bd8598fc_thumb.jpg',
        sellCount: 22222,
        wechat: 'www.yunjiazheng.com/baojie',
        wechatUrl: 'http://www.daoway.cn/pcimages/daowayApp.png',
        serveDesribe: {
          text: '服务内容：\n1.厢货车辆容积：4.2米*1.9米*1.9米=15.16立方，可装载个人物品和大中型家电；\n2.里程：包含10公里，超出后6元/公里\n3.搬运：有电梯免费搬运，无电梯楼层搬运按楼层阶梯式收费\n4.提供司机师傅2人独立搬运（包含电视、冰箱和洗衣机等免费搬运）\n5.拆装家具按照类别额外收费\n\n服务保障：\n7＊24小时全天候服务\n不满意全额退款',
          promise: '1.商家将在您下单后30分钟内确认接单；\n2.订单确认后，修改订单或退款需提前2小时通知；\n3.预约时间前2小时内退单将按30元/人扣取误工费；车辆到达后再退单将按100元/辆扣取空驶费；\n4.如商家接单后爽约将全额退款并向您额外赔付30元；\n5.为保障您的权益，所有费用请通过到位平台支付。',
        },
        fater: null
      },
      {
        serviceID: 60, // 对应服务提供商
        class: 6,// 对应banner导航一级菜单 搬家速运
        type: '搬家套餐',  // 对应二级菜单  搬家套餐
        name: '厢货搬家', // 对应选项卡名
        price: 125,
        oldPrice: 156,
        avatar: 'http://img.daoway.cn/img/2016/05/01/ddb766bf-d983-4827-8461-b569f8f4a18b_thumb.jpg',
        sellCount: 22222,
        wechat: 'www.yunjiazheng.com/baojie',
        wechatUrl: 'http://www.daoway.cn/pcimages/daowayApp.png',
        serveDesribe: {
          text: '服务内容：\n1.厢货车辆容积：4.2米*1.9米*1.9米=15.16立方，可装载个人物品和大中型家电；\n2.里程：包含10公里，超出后6元/公里\n3.搬运：有电梯免费搬运，无电梯楼层搬运按楼层阶梯式收费\n4.提供司机师傅2人独立搬运（包含电视、冰箱和洗衣机等免费搬运）\n5.拆装家具按照类别额外收费\n\n服务保障：\n7＊24小时全天候服务\n不满意全额退款',
          promise: '1.商家将在您下单后30分钟内确认接单；\n2.订单确认后，修改订单或退款需提前2小时通知；\n3.预约时间前2小时内退单将按30元/人扣取误工费；车辆到达后再退单将按100元/辆扣取空驶费；\n4.如商家接单后爽约将全额退款并向您额外赔付30元；\n5.为保障您的权益，所有费用请通过到位平台支付。',
        },
        fater: null
      },],},
  {
    className: '美容美妆',
    classType:7,
    serves: [
      {
        serviceID: 70, // 对应服务提供商
        class: 7,// 对应banner导航一级菜单 美容美妆
        type: '化妆',  // 对应二级菜单  搬家套餐
        name: '生活妆', // 对应选项卡名
        price: 125,
        oldPrice: 156,
        avatar: 'http://img.daoway.cn/img/2016/11/30/0c24fa7d-fead-4d27-ac4d-8b56f6e621ec.jpg',
        sellCount: 22222,
        wechat: 'www.yunjiazheng.com/baojie',
        wechatUrl: 'http://www.daoway.cn/pcimages/daowayApp.png',
        serveDesribe: {
          text: '在日常生活中用化妆能快速修饰自己的皮肤、脸型等问题，美着呢就是你的专属彩妆顾问。',
          promise: '上门服务开始前2小时申请退款，退还50%，2小时内不予退款！',
        },
        fater: null
      },
      {
        serviceID: 70, // 对应服务提供商
        class: 7,// 对应banner导航一级菜单 搬家速运
        type: '美容美妆',  // 对应二级菜单  搬家套餐
        name: '生活妆', // 对应选项卡名
        price: 125,
        oldPrice: 156,
        avatar: 'http://img.daoway.cn/img/2016/11/30/0c24fa7d-fead-4d27-ac4d-8b56f6e621ec.jpg',
        sellCount: 22222,
        wechat: 'www.yunjiazheng.com/baojie',
        wechatUrl: 'http://www.daoway.cn/pcimages/daowayApp.png',
        serveDesribe: {
          text: '在日常生活中用化妆能快速修饰自己的皮肤、脸型等问题，美着呢就是你的专属彩妆顾问。',
          promise: '上门服务开始前2小时申请退款，退还50%，2小时内不予退款！',
        },
        fater: null
      },
      {
        serviceID: 70, // 对应服务提供商
        class: 7,// 对应banner导航一级菜单 搬家速运
        type: '美容美妆',  // 对应二级菜单  搬家套餐
        name: '生活妆', // 对应选项卡名
        price: 125,
        oldPrice: 156,
        avatar: 'http://img.daoway.cn/img/2016/11/30/0c24fa7d-fead-4d27-ac4d-8b56f6e621ec.jpg',
        sellCount: 22222,
        wechat: 'www.yunjiazheng.com/baojie',
        wechatUrl: 'http://www.daoway.cn/pcimages/daowayApp.png',
        serveDesribe: {
          text: '在日常生活中用化妆能快速修饰自己的皮肤、脸型等问题，美着呢就是你的专属彩妆顾问。',
          promise: '上门服务开始前2小时申请退款，退还50%，2小时内不予退款！',
        },
        fater: null
      },
      {
        serviceID: 70, // 对应服务提供商
        class: 7,// 对应banner导航一级菜单 搬家速运
        type: '美容美妆',  // 对应二级菜单  搬家套餐
        name: '生活妆', // 对应选项卡名
        price: 125,
        oldPrice: 156,
        avatar: 'http://img.daoway.cn/img/2016/11/30/0c24fa7d-fead-4d27-ac4d-8b56f6e621ec.jpg',
        sellCount: 22222,
        wechat: 'www.yunjiazheng.com/baojie',
        wechatUrl: 'http://www.daoway.cn/pcimages/daowayApp.png',
        serveDesribe: {
          text: '在日常生活中用化妆能快速修饰自己的皮肤、脸型等问题，美着呢就是你的专属彩妆顾问。',
          promise: '上门服务开始前2小时申请退款，退还50%，2小时内不予退款！',
        },
        fater: null
      },
      {
        serviceID: 70, // 对应服务提供商
        class: 7,// 对应banner导航一级菜单 搬家速运
        type: '美容美妆',  // 对应二级菜单  搬家套餐
        name: '生活妆', // 对应选项卡名
        price: 125,
        oldPrice: 156,
        avatar: 'http://img.daoway.cn/img/2016/11/30/0c24fa7d-fead-4d27-ac4d-8b56f6e621ec.jpg',
        sellCount: 22222,
        wechat: 'www.yunjiazheng.com/baojie',
        wechatUrl: 'http://www.daoway.cn/pcimages/daowayApp.png',
        serveDesribe: {
          text: '在日常生活中用化妆能快速修饰自己的皮肤、脸型等问题，美着呢就是你的专属彩妆顾问。',
          promise: '上门服务开始前2小时申请退款，退还50%，2小时内不予退款！',
        },
        fater: null
      },],},
  {
    className: '上门医护',
    classType:8,
    serves: [
      {
        serviceID: 80, // 对应服务提供商
        class: 8,// 对应banner导航一级菜单 上门医护
        type: '打针输液',  // 对应二级菜单  搬家套餐
        name: '上门打针', // 对应选项卡名
        price: 125,
        oldPrice: 156,
        avatar: 'http://img.daoway.cn/img/2017/03/01/7287e072-1430-4edb-b962-d7b81e4392f2.jpg',
        sellCount: 22222,
        wechat: 'www.yunjiazheng.com/baojie',
        wechatUrl: 'http://www.daoway.cn/pcimages/daowayApp.png',
        serveDesribe: {
          text: '产品介绍：\n1.皮下注射：将小量药液注入皮下组织，注射部位常见上臂三角肌下缘、上臂外侧、腹部、后背及大腿外侧方主，常用于胰岛素注射、预防接种等；\n2.肌肉注射：将药液注入肌肉组织，最常用的注射部位为臀大肌，是小儿患病时常用的一种给药方法。常用于破伤风、黄体酮注射等。\n\n服务内容：\n打针服务，提供皮下及肌肉注射。不提供药物过敏试验或抗生素类、美容整形类的药物注射（药物过敏试验、抗生素注射等风险较大，请到医院注射）。护士只提供打针技术服务，不提供药品及相关物品\n\n适用人群：\n不宜或不能做静脉注射，要求更迅速发生疗效时，以及注射刺激性较强或药量较大的药物的群体。\n\n禁忌事项：\n对该药物过敏者；\n两种药物同时注射时，须在不同部位注射；\n避免在瘢痕、硬结、发炎、皮肤病、淤血或血肿部位及旧针眼处注射；\n有严重出、凝血倾向，血小板明显减少或用肝素、双香豆素等进行抗凝治疗暂禁穿刺者。\n包括但不限于上述禁忌症，均不能提供服务\n\n特别说明：\n1、没有药品护士无法提供上门服务\n2、我们强烈建议您自备打针或输液等相关工具，如无法自备，可委托上门服务护士协商代购\n相关收费参考标准：\n生理盐水:15元/瓶\n打针工具:10元/套（含注射器、棉签，消毒液等）\n输液工具:25元/套（含输液器、棉签，消毒液、止血带、头\n皮针、输液贴等）\n输液服务包含扎针、看护、拔针全程服务，及时处理输\n液过程中的常见问题，为用户全方位保驾护航！',
          promise: '1.商家将在您下单后30分钟内确认是否接单；\n2.订单确认后，修改订单或退款需提前2小时通知；\n3.预约时间前2小时内退单将按30元/人扣取空单费；\n4.如商家接单后爽约将全额退款并向您额外赔付30元；\n5.为保障您的权益，所有费用请通过到位平台支付。\n6.金牌护士服务人员均为通过平台审核的具有专业护理资质的从业人员，均遵照各大医院正规护理程序进行服务。\n7.请如实填写与被服务者相关的联系方式、预约地址及其他相关信息。\n8.为保证服务质量，我们的服务人员可能会在服务过程中录音。',
        },
        fater: null
      },
      {
        serviceID: 80, // 对应服务提供商
        class: 8,// 对应banner导航一级菜单 上门医护
        type: '打针输液',  // 对应二级菜单  搬家套餐
        name: '上门打针', // 对应选项卡名
        price: 125,
        oldPrice: 156,
        avatar: 'http://img.daoway.cn/img/2017/03/01/7287e072-1430-4edb-b962-d7b81e4392f2.jpg',
        sellCount: 22222,
        wechat: 'www.yunjiazheng.com/baojie',
        wechatUrl: 'http://www.daoway.cn/pcimages/daowayApp.png',
        serveDesribe: {
          text: '产品介绍：\n1.皮下注射：将小量药液注入皮下组织，注射部位常见上臂三角肌下缘、上臂外侧、腹部、后背及大腿外侧方主，常用于胰岛素注射、预防接种等；\n2.肌肉注射：将药液注入肌肉组织，最常用的注射部位为臀大肌，是小儿患病时常用的一种给药方法。常用于破伤风、黄体酮注射等。\n\n服务内容：\n打针服务，提供皮下及肌肉注射。不提供药物过敏试验或抗生素类、美容整形类的药物注射（药物过敏试验、抗生素注射等风险较大，请到医院注射）。护士只提供打针技术服务，不提供药品及相关物品\n\n适用人群：\n不宜或不能做静脉注射，要求更迅速发生疗效时，以及注射刺激性较强或药量较大的药物的群体。\n\n禁忌事项：\n对该药物过敏者；\n两种药物同时注射时，须在不同部位注射；\n避免在瘢痕、硬结、发炎、皮肤病、淤血或血肿部位及旧针眼处注射；\n有严重出、凝血倾向，血小板明显减少或用肝素、双香豆素等进行抗凝治疗暂禁穿刺者。\n包括但不限于上述禁忌症，均不能提供服务\n\n特别说明：\n1、没有药品护士无法提供上门服务\n2、我们强烈建议您自备打针或输液等相关工具，如无法自备，可委托上门服务护士协商代购\n相关收费参考标准：\n生理盐水:15元/瓶\n打针工具:10元/套（含注射器、棉签，消毒液等）\n输液工具:25元/套（含输液器、棉签，消毒液、止血带、头\n皮针、输液贴等）\n输液服务包含扎针、看护、拔针全程服务，及时处理输\n液过程中的常见问题，为用户全方位保驾护航！',
          promise: '1.商家将在您下单后30分钟内确认是否接单；\n2.订单确认后，修改订单或退款需提前2小时通知；\n3.预约时间前2小时内退单将按30元/人扣取空单费；\n4.如商家接单后爽约将全额退款并向您额外赔付30元；\n5.为保障您的权益，所有费用请通过到位平台支付。\n6.金牌护士服务人员均为通过平台审核的具有专业护理资质的从业人员，均遵照各大医院正规护理程序进行服务。\n7.请如实填写与被服务者相关的联系方式、预约地址及其他相关信息。\n8.为保证服务质量，我们的服务人员可能会在服务过程中录音。',
        },
        fater: null
      },
      {
        serviceID: 80, // 对应服务提供商
        class: 8,// 对应banner导航一级菜单 上门医护
        type: '打针输液',  // 对应二级菜单  搬家套餐
        name: '上门打针', // 对应选项卡名
        price: 125,
        oldPrice: 156,
        avatar: 'http://img.daoway.cn/img/2017/03/01/7287e072-1430-4edb-b962-d7b81e4392f2.jpg',
        sellCount: 22222,
        wechat: 'www.yunjiazheng.com/baojie',
        wechatUrl: 'http://www.daoway.cn/pcimages/daowayApp.png',
        serveDesribe: {
          text: '产品介绍：\n1.皮下注射：将小量药液注入皮下组织，注射部位常见上臂三角肌下缘、上臂外侧、腹部、后背及大腿外侧方主，常用于胰岛素注射、预防接种等；\n2.肌肉注射：将药液注入肌肉组织，最常用的注射部位为臀大肌，是小儿患病时常用的一种给药方法。常用于破伤风、黄体酮注射等。\n\n服务内容：\n打针服务，提供皮下及肌肉注射。不提供药物过敏试验或抗生素类、美容整形类的药物注射（药物过敏试验、抗生素注射等风险较大，请到医院注射）。护士只提供打针技术服务，不提供药品及相关物品\n\n适用人群：\n不宜或不能做静脉注射，要求更迅速发生疗效时，以及注射刺激性较强或药量较大的药物的群体。\n\n禁忌事项：\n对该药物过敏者；\n两种药物同时注射时，须在不同部位注射；\n避免在瘢痕、硬结、发炎、皮肤病、淤血或血肿部位及旧针眼处注射；\n有严重出、凝血倾向，血小板明显减少或用肝素、双香豆素等进行抗凝治疗暂禁穿刺者。\n包括但不限于上述禁忌症，均不能提供服务\n\n特别说明：\n1、没有药品护士无法提供上门服务\n2、我们强烈建议您自备打针或输液等相关工具，如无法自备，可委托上门服务护士协商代购\n相关收费参考标准：\n生理盐水:15元/瓶\n打针工具:10元/套（含注射器、棉签，消毒液等）\n输液工具:25元/套（含输液器、棉签，消毒液、止血带、头\n皮针、输液贴等）\n输液服务包含扎针、看护、拔针全程服务，及时处理输\n液过程中的常见问题，为用户全方位保驾护航！',
          promise: '1.商家将在您下单后30分钟内确认是否接单；\n2.订单确认后，修改订单或退款需提前2小时通知；\n3.预约时间前2小时内退单将按30元/人扣取空单费；\n4.如商家接单后爽约将全额退款并向您额外赔付30元；\n5.为保障您的权益，所有费用请通过到位平台支付。\n6.金牌护士服务人员均为通过平台审核的具有专业护理资质的从业人员，均遵照各大医院正规护理程序进行服务。\n7.请如实填写与被服务者相关的联系方式、预约地址及其他相关信息。\n8.为保证服务质量，我们的服务人员可能会在服务过程中录音。',
        },
        fater: null
      },
      {
        serviceID: 80, // 对应服务提供商
        class: 8,// 对应banner导航一级菜单 上门医护
        type: '打针输液',  // 对应二级菜单  搬家套餐
        name: '上门打针', // 对应选项卡名
        price: 125,
        oldPrice: 156,
        avatar: 'http://img.daoway.cn/img/2017/03/01/7287e072-1430-4edb-b962-d7b81e4392f2.jpg',
        sellCount: 22222,
        wechat: 'www.yunjiazheng.com/baojie',
        wechatUrl: 'http://www.daoway.cn/pcimages/daowayApp.png',
        serveDesribe: {
          text: '产品介绍：\n1.皮下注射：将小量药液注入皮下组织，注射部位常见上臂三角肌下缘、上臂外侧、腹部、后背及大腿外侧方主，常用于胰岛素注射、预防接种等；\n2.肌肉注射：将药液注入肌肉组织，最常用的注射部位为臀大肌，是小儿患病时常用的一种给药方法。常用于破伤风、黄体酮注射等。\n\n服务内容：\n打针服务，提供皮下及肌肉注射。不提供药物过敏试验或抗生素类、美容整形类的药物注射（药物过敏试验、抗生素注射等风险较大，请到医院注射）。护士只提供打针技术服务，不提供药品及相关物品\n\n适用人群：\n不宜或不能做静脉注射，要求更迅速发生疗效时，以及注射刺激性较强或药量较大的药物的群体。\n\n禁忌事项：\n对该药物过敏者；\n两种药物同时注射时，须在不同部位注射；\n避免在瘢痕、硬结、发炎、皮肤病、淤血或血肿部位及旧针眼处注射；\n有严重出、凝血倾向，血小板明显减少或用肝素、双香豆素等进行抗凝治疗暂禁穿刺者。\n包括但不限于上述禁忌症，均不能提供服务\n\n特别说明：\n1、没有药品护士无法提供上门服务\n2、我们强烈建议您自备打针或输液等相关工具，如无法自备，可委托上门服务护士协商代购\n相关收费参考标准：\n生理盐水:15元/瓶\n打针工具:10元/套（含注射器、棉签，消毒液等）\n输液工具:25元/套（含输液器、棉签，消毒液、止血带、头\n皮针、输液贴等）\n输液服务包含扎针、看护、拔针全程服务，及时处理输\n液过程中的常见问题，为用户全方位保驾护航！',
          promise: '1.商家将在您下单后30分钟内确认是否接单；\n2.订单确认后，修改订单或退款需提前2小时通知；\n3.预约时间前2小时内退单将按30元/人扣取空单费；\n4.如商家接单后爽约将全额退款并向您额外赔付30元；\n5.为保障您的权益，所有费用请通过到位平台支付。\n6.金牌护士服务人员均为通过平台审核的具有专业护理资质的从业人员，均遵照各大医院正规护理程序进行服务。\n7.请如实填写与被服务者相关的联系方式、预约地址及其他相关信息。\n8.为保证服务质量，我们的服务人员可能会在服务过程中录音。',
        },
        fater: null
      },
      {
        serviceID: 80, // 对应服务提供商
        class: 8,// 对应banner导航一级菜单 上门医护
        type: '打针输液',  // 对应二级菜单  搬家套餐
        name: '上门打针', // 对应选项卡名
        price: 125,
        oldPrice: 156,
        avatar: 'http://img.daoway.cn/img/2017/03/01/7287e072-1430-4edb-b962-d7b81e4392f2.jpg',
        sellCount: 22222,
        wechat: 'www.yunjiazheng.com/baojie',
        wechatUrl: 'http://www.daoway.cn/pcimages/daowayApp.png',
        serveDesribe: {
          text: '产品介绍：\n1.皮下注射：将小量药液注入皮下组织，注射部位常见上臂三角肌下缘、上臂外侧、腹部、后背及大腿外侧方主，常用于胰岛素注射、预防接种等；\n2.肌肉注射：将药液注入肌肉组织，最常用的注射部位为臀大肌，是小儿患病时常用的一种给药方法。常用于破伤风、黄体酮注射等。\n\n服务内容：\n打针服务，提供皮下及肌肉注射。不提供药物过敏试验或抗生素类、美容整形类的药物注射（药物过敏试验、抗生素注射等风险较大，请到医院注射）。护士只提供打针技术服务，不提供药品及相关物品\n\n适用人群：\n不宜或不能做静脉注射，要求更迅速发生疗效时，以及注射刺激性较强或药量较大的药物的群体。\n\n禁忌事项：\n对该药物过敏者；\n两种药物同时注射时，须在不同部位注射；\n避免在瘢痕、硬结、发炎、皮肤病、淤血或血肿部位及旧针眼处注射；\n有严重出、凝血倾向，血小板明显减少或用肝素、双香豆素等进行抗凝治疗暂禁穿刺者。\n包括但不限于上述禁忌症，均不能提供服务\n\n特别说明：\n1、没有药品护士无法提供上门服务\n2、我们强烈建议您自备打针或输液等相关工具，如无法自备，可委托上门服务护士协商代购\n相关收费参考标准：\n生理盐水:15元/瓶\n打针工具:10元/套（含注射器、棉签，消毒液等）\n输液工具:25元/套（含输液器、棉签，消毒液、止血带、头\n皮针、输液贴等）\n输液服务包含扎针、看护、拔针全程服务，及时处理输\n液过程中的常见问题，为用户全方位保驾护航！',
          promise: '1.商家将在您下单后30分钟内确认是否接单；\n2.订单确认后，修改订单或退款需提前2小时通知；\n3.预约时间前2小时内退单将按30元/人扣取空单费；\n4.如商家接单后爽约将全额退款并向您额外赔付30元；\n5.为保障您的权益，所有费用请通过到位平台支付。\n6.金牌护士服务人员均为通过平台审核的具有专业护理资质的从业人员，均遵照各大医院正规护理程序进行服务。\n7.请如实填写与被服务者相关的联系方式、预约地址及其他相关信息。\n8.为保证服务质量，我们的服务人员可能会在服务过程中录音。',
        },
        fater: null
      },],},
  {
    className: '养车护车',
    classType: 9,
    serves: [
      {
        serviceID: 90, // 对应服务提供商
        class: 9,// 对应banner导航一级菜单 养车护车
        type: '上门养车',  // 对应二级菜单  搬家套餐
        name: '小保养+全车检测', // 对应选项卡名  小保养+全车检测
        price: 125,
        oldPrice: 156,
        avatar: 'http://img.daoway.cn/img/2016/07/06/2c4b29c4-ff73-4a9c-9969-af410cbcd959.jpg',
        sellCount: 22222,
        wechat: 'www.yunjiazheng.com/baojie',
        wechatUrl: 'http://www.daoway.cn/pcimages/daowayApp.png',
        serveDesribe: {
          text: '汽车需保养，流动车吧养车小哥为帮忙！\n\n费用说明：\n1.安耐驰全合成SN5w40机油4L+品牌机滤+上门服务（部分价格超规的保养配件需按市场价格酌情补充差价）\n2.超过4L部分每L收费58元',
          promise: '1.商家将在您下单后30分钟内确认是否接单，服务时间须另行商定；\n2.订单确认后，修改订单或退款需提前2小时通知；\n3.预约时间前2小时内退单将按30元/人扣取空单费；\n4.如商家接单后爽约将全额退款并向您额外赔付30元；\n5.为保障您的权益，所有费用请通过到位平台支付。',
        },
        fater: null
      },
      {
        serviceID: 90, // 对应服务提供商
        class: 9,// 对应banner导航一级菜单 养车护车
        type: '上门养车',  // 对应二级菜单  搬家套餐
        name: '小保养+全车检测', // 对应选项卡名  小保养+全车检测
        price: 125,
        oldPrice: 156,
        avatar: 'http://img.daoway.cn/img/2016/07/06/2c4b29c4-ff73-4a9c-9969-af410cbcd959.jpg',
        sellCount: 22222,
        wechat: 'www.yunjiazheng.com/baojie',
        wechatUrl: 'http://www.daoway.cn/pcimages/daowayApp.png',
        serveDesribe: {
          text: '汽车需保养，流动车吧养车小哥为帮忙！\n\n费用说明：\n1.安耐驰全合成SN5w40机油4L+品牌机滤+上门服务（部分价格超规的保养配件需按市场价格酌情补充差价）\n2.超过4L部分每L收费58元',
          promise: '1.商家将在您下单后30分钟内确认是否接单，服务时间须另行商定；\n2.订单确认后，修改订单或退款需提前2小时通知；\n3.预约时间前2小时内退单将按30元/人扣取空单费；\n4.如商家接单后爽约将全额退款并向您额外赔付30元；\n5.为保障您的权益，所有费用请通过到位平台支付。',
        },
        fater: null
      },
      {
        serviceID: 90, // 对应服务提供商
        class: 9,// 对应banner导航一级菜单 养车护车
        type: '上门养车',  // 对应二级菜单  搬家套餐
        name: '小保养+全车检测', // 对应选项卡名  小保养+全车检测
        price: 125,
        oldPrice: 156,
        avatar: 'http://img.daoway.cn/img/2016/07/06/2c4b29c4-ff73-4a9c-9969-af410cbcd959.jpg',
        sellCount: 22222,
        wechat: 'www.yunjiazheng.com/baojie',
        wechatUrl: 'http://www.daoway.cn/pcimages/daowayApp.png',
        serveDesribe: {
          text: '汽车需保养，流动车吧养车小哥为帮忙！\n\n费用说明：\n1.安耐驰全合成SN5w40机油4L+品牌机滤+上门服务（部分价格超规的保养配件需按市场价格酌情补充差价）\n2.超过4L部分每L收费58元',
          promise: '1.商家将在您下单后30分钟内确认是否接单，服务时间须另行商定；\n2.订单确认后，修改订单或退款需提前2小时通知；\n3.预约时间前2小时内退单将按30元/人扣取空单费；\n4.如商家接单后爽约将全额退款并向您额外赔付30元；\n5.为保障您的权益，所有费用请通过到位平台支付。',
        },
        fater: null
      },
      {
        serviceID: 90, // 对应服务提供商
        class: 9,// 对应banner导航一级菜单 养车护车
        type: '上门养车',  // 对应二级菜单  搬家套餐
        name: '小保养+全车检测', // 对应选项卡名  小保养+全车检测
        price: 125,
        oldPrice: 156,
        avatar: 'http://img.daoway.cn/img/2016/07/06/2c4b29c4-ff73-4a9c-9969-af410cbcd959.jpg',
        sellCount: 22222,
        wechat: 'www.yunjiazheng.com/baojie',
        wechatUrl: 'http://www.daoway.cn/pcimages/daowayApp.png',
        serveDesribe: {
          text: '汽车需保养，流动车吧养车小哥为帮忙！\n\n费用说明：\n1.安耐驰全合成SN5w40机油4L+品牌机滤+上门服务（部分价格超规的保养配件需按市场价格酌情补充差价）\n2.超过4L部分每L收费58元',
          promise: '1.商家将在您下单后30分钟内确认是否接单，服务时间须另行商定；\n2.订单确认后，修改订单或退款需提前2小时通知；\n3.预约时间前2小时内退单将按30元/人扣取空单费；\n4.如商家接单后爽约将全额退款并向您额外赔付30元；\n5.为保障您的权益，所有费用请通过到位平台支付。',
        },
        fater: null
      },
      {
        serviceID: 90, // 对应服务提供商
        class: 9,// 对应banner导航一级菜单 养车护车
        type: '上门养车',  // 对应二级菜单  搬家套餐
        name: '小保养+全车检测', // 对应选项卡名  小保养+全车检测
        price: 125,
        oldPrice: 156,
        avatar: 'http://img.daoway.cn/img/2016/07/06/2c4b29c4-ff73-4a9c-9969-af410cbcd959.jpg',
        sellCount: 22222,
        wechat: 'www.yunjiazheng.com/baojie',
        wechatUrl: 'http://www.daoway.cn/pcimages/daowayApp.png',
        serveDesribe: {
          text: '汽车需保养，流动车吧养车小哥为帮忙！\n\n费用说明：\n1.安耐驰全合成SN5w40机油4L+品牌机滤+上门服务（部分价格超规的保养配件需按市场价格酌情补充差价）\n2.超过4L部分每L收费58元',
          promise: '1.商家将在您下单后30分钟内确认是否接单，服务时间须另行商定；\n2.订单确认后，修改订单或退款需提前2小时通知；\n3.预约时间前2小时内退单将按30元/人扣取空单费；\n4.如商家接单后爽约将全额退款并向您额外赔付30元；\n5.为保障您的权益，所有费用请通过到位平台支付。',
        },
        fater: null
      },],},
  {
    className: '月嫂保姆',
    classType: 10,
    serves: [
      {
        serviceID: 100, // 对应服务提供商
        class: 10,// 对应banner导航一级菜单 月嫂保姆
        type: '月嫂',  // 对应二级菜单  月嫂
        name: '初级月嫂', // 对应选项卡名  初级月嫂
        price: 7800,
        oldPrice: 0,
        avatar: 'http://img.daoway.cn/img/2017/03/23/c7b5ba9c-6e94-4e49-b4df-11d7ea7b4478.jpg',
        sellCount: 22222,
        wechat: 'www.yunjiazheng.com/baojie',
        wechatUrl: 'http://www.daoway.cn/pcimages/daowayApp.png',
        serveDesribe: {
          text: '服务内容：\n1.宝宝护理：宝宝的生活护理和专业护理\n皮肤护理、喂养指导、五官护理、脐部护理、臀部护理、二便观察、黄疸观察、洗澡抚触、常见病观察与护理、奶具清洗消毒、衣物清洁及消毒、良好习惯养成\n2.妈妈护理：产妇的生活护理和专业护理\n月子餐制作、乳房护理、心理疏导、恶露观擦、伤口护理、形体恢复、衣物及室内清洁、产妇擦浴\n\n月嫂资历：\n学历：大专或早教或护理专业毕业\n经历：海婴医院实践培训并有专家指导；具备五级月嫂生活服务基础；5年以上工作经验；或连续看护40个以上婴儿无差错。\n资格认证：高级家政服务员资格证书；月嫂证书；催乳证书；营养师证书',
          promise: '1.商家将在您下单后30分钟内确认接单；\n2.订单确认后，修改订单或退款需提前2小时通知；\n3.预约时间前2小时内退单将按30元/人扣取误工费；\n4.如商家接单后爽约将全额退款并向您额外赔付30元；\n5.为保障您的权益，所有费用请通过到位平台支付。',
        },
        fater: null
      },
      {
        serviceID: 100, // 对应服务提供商
        class: 10,// 对应banner导航一级菜单 月嫂保姆
        type: '月嫂',  // 对应二级菜单  月嫂
        name: '初级月嫂', // 对应选项卡名  初级月嫂
        price: 7800,
        oldPrice: 0,
        avatar: 'http://img.daoway.cn/img/2017/03/23/c7b5ba9c-6e94-4e49-b4df-11d7ea7b4478.jpg',
        sellCount: 22222,
        wechat: 'www.yunjiazheng.com/baojie',
        wechatUrl: 'http://www.daoway.cn/pcimages/daowayApp.png',
        serveDesribe: {
          text: '服务内容：\n1.宝宝护理：宝宝的生活护理和专业护理\n皮肤护理、喂养指导、五官护理、脐部护理、臀部护理、二便观察、黄疸观察、洗澡抚触、常见病观察与护理、奶具清洗消毒、衣物清洁及消毒、良好习惯养成\n2.妈妈护理：产妇的生活护理和专业护理\n月子餐制作、乳房护理、心理疏导、恶露观擦、伤口护理、形体恢复、衣物及室内清洁、产妇擦浴\n\n月嫂资历：\n学历：大专或早教或护理专业毕业\n经历：海婴医院实践培训并有专家指导；具备五级月嫂生活服务基础；5年以上工作经验；或连续看护40个以上婴儿无差错。\n资格认证：高级家政服务员资格证书；月嫂证书；催乳证书；营养师证书',
          promise: '1.商家将在您下单后30分钟内确认接单；\n2.订单确认后，修改订单或退款需提前2小时通知；\n3.预约时间前2小时内退单将按30元/人扣取误工费；\n4.如商家接单后爽约将全额退款并向您额外赔付30元；\n5.为保障您的权益，所有费用请通过到位平台支付。',
        },
        fater: null
      },
      {
        serviceID: 100, // 对应服务提供商
        class: 10,// 对应banner导航一级菜单 月嫂保姆
        type: '月嫂',  // 对应二级菜单  月嫂
        name: '初级月嫂', // 对应选项卡名  初级月嫂
        price: 7800,
        oldPrice: 0,
        avatar: 'http://img.daoway.cn/img/2017/03/23/c7b5ba9c-6e94-4e49-b4df-11d7ea7b4478.jpg',
        sellCount: 22222,
        wechat: 'www.yunjiazheng.com/baojie',
        wechatUrl: 'http://www.daoway.cn/pcimages/daowayApp.png',
        serveDesribe: {
          text: '服务内容：\n1.宝宝护理：宝宝的生活护理和专业护理\n皮肤护理、喂养指导、五官护理、脐部护理、臀部护理、二便观察、黄疸观察、洗澡抚触、常见病观察与护理、奶具清洗消毒、衣物清洁及消毒、良好习惯养成\n2.妈妈护理：产妇的生活护理和专业护理\n月子餐制作、乳房护理、心理疏导、恶露观擦、伤口护理、形体恢复、衣物及室内清洁、产妇擦浴\n\n月嫂资历：\n学历：大专或早教或护理专业毕业\n经历：海婴医院实践培训并有专家指导；具备五级月嫂生活服务基础；5年以上工作经验；或连续看护40个以上婴儿无差错。\n资格认证：高级家政服务员资格证书；月嫂证书；催乳证书；营养师证书',
          promise: '1.商家将在您下单后30分钟内确认接单；\n2.订单确认后，修改订单或退款需提前2小时通知；\n3.预约时间前2小时内退单将按30元/人扣取误工费；\n4.如商家接单后爽约将全额退款并向您额外赔付30元；\n5.为保障您的权益，所有费用请通过到位平台支付。',
        },
        fater: null
      },
      {
        serviceID: 100, // 对应服务提供商
        class: 10,// 对应banner导航一级菜单 月嫂保姆
        type: '月嫂',  // 对应二级菜单  月嫂
        name: '初级月嫂', // 对应选项卡名  初级月嫂
        price: 7800,
        oldPrice: 0,
        avatar: 'http://img.daoway.cn/img/2017/03/23/c7b5ba9c-6e94-4e49-b4df-11d7ea7b4478.jpg',
        sellCount: 22222,
        wechat: 'www.yunjiazheng.com/baojie',
        wechatUrl: 'http://www.daoway.cn/pcimages/daowayApp.png',
        serveDesribe: {
          text: '服务内容：\n1.宝宝护理：宝宝的生活护理和专业护理\n皮肤护理、喂养指导、五官护理、脐部护理、臀部护理、二便观察、黄疸观察、洗澡抚触、常见病观察与护理、奶具清洗消毒、衣物清洁及消毒、良好习惯养成\n2.妈妈护理：产妇的生活护理和专业护理\n月子餐制作、乳房护理、心理疏导、恶露观擦、伤口护理、形体恢复、衣物及室内清洁、产妇擦浴\n\n月嫂资历：\n学历：大专或早教或护理专业毕业\n经历：海婴医院实践培训并有专家指导；具备五级月嫂生活服务基础；5年以上工作经验；或连续看护40个以上婴儿无差错。\n资格认证：高级家政服务员资格证书；月嫂证书；催乳证书；营养师证书',
          promise: '1.商家将在您下单后30分钟内确认接单；\n2.订单确认后，修改订单或退款需提前2小时通知；\n3.预约时间前2小时内退单将按30元/人扣取误工费；\n4.如商家接单后爽约将全额退款并向您额外赔付30元；\n5.为保障您的权益，所有费用请通过到位平台支付。',
        },
        fater: null
      },
      {
        serviceID: 100, // 对应服务提供商
        class: 10,// 对应banner导航一级菜单 月嫂保姆
        type: '月嫂',  // 对应二级菜单  月嫂
        name: '初级月嫂', // 对应选项卡名  初级月嫂
        price: 7800,
        oldPrice: 0,
        avatar: 'http://img.daoway.cn/img/2017/03/23/c7b5ba9c-6e94-4e49-b4df-11d7ea7b4478.jpg',
        sellCount: 22222,
        wechat: 'www.yunjiazheng.com/baojie',
        wechatUrl: 'http://www.daoway.cn/pcimages/daowayApp.png',
        serveDesribe: {
          text: '服务内容：\n1.宝宝护理：宝宝的生活护理和专业护理\n皮肤护理、喂养指导、五官护理、脐部护理、臀部护理、二便观察、黄疸观察、洗澡抚触、常见病观察与护理、奶具清洗消毒、衣物清洁及消毒、良好习惯养成\n2.妈妈护理：产妇的生活护理和专业护理\n月子餐制作、乳房护理、心理疏导、恶露观擦、伤口护理、形体恢复、衣物及室内清洁、产妇擦浴\n\n月嫂资历：\n学历：大专或早教或护理专业毕业\n经历：海婴医院实践培训并有专家指导；具备五级月嫂生活服务基础；5年以上工作经验；或连续看护40个以上婴儿无差错。\n资格认证：高级家政服务员资格证书；月嫂证书；催乳证书；营养师证书',
          promise: '1.商家将在您下单后30分钟内确认接单；\n2.订单确认后，修改订单或退款需提前2小时通知；\n3.预约时间前2小时内退单将按30元/人扣取误工费；\n4.如商家接单后爽约将全额退款并向您额外赔付30元；\n5.为保障您的权益，所有费用请通过到位平台支付。',
        },
        fater: null
      },],},
]

var serves = require('../data/page.json')

var template = `<div class="detail_content">
    <div class="container">
      <div class="nav_title clearfix">
        <div class="title">
          所有分类
          <i>&gt;</i>
          <i>室内清洁</i>
          <i>&gt;</i>
          <i class="now">室内清洁</i>
        </div>
      </div>
      <div class="serve-wrap clearfix">
        <div class="serve-left">

          <div id="1" class="serve-top clearfix">
            <img src="<%= avatar%>">
            <div class="serve-info">
              <h4><%= name %></h4>
              <p class="price-wrap">
                <span class="price">价格 <i><%= price %></i></span>
                <span class="old-price">原价<i><%= oldPrice %></i></span>
              </p>
              <span class="sell-count">已售<i><%= selleCount %></i></span>
            </div>
            <div class="qr-wrap">
              <img src="./img/join-2.png">
              <span>扫一扫</span>
              <span>立即预约</span>
            </div>
          </div>

          <div class="serve-down">
            <p class="title"><span>服务描述</span></p>
            <p class="text">
              <%= text %>
            </p>
            <p class="title"><span>服务范围</span></p>
            <p class="text">

              <span><%= cities %></span>

            </p>
            <p class="title"><span>服务时间</span></p>
            <p class="text">8:00-18:00</p>
            <p class="title"><span>订购须知</span></p>
            <p class="text">
1.商家将在您下单后30分钟内确认是否接单；<br>2.订单确认后，修改订单或退款需提前2小时通知；<br>3.预约时间前2小时内退单将按30元/人扣取空单费；<br>4.如商家接单后爽约将全额退款并向您额外赔付30元；<br>5.为保障您的权益，所有费用请通过到位平台支付。
            </p>
            <p class="title"><span>商家简介</span></p>
            <p class="text">
            爱浓情家政公司的家政员来源于吉林、山西、陕西、河北、甘肃、安徽等地。家政员经过当地劳动局和妇联推荐，同时经过严格筛选，具有体检证明或健康证。
            </p>
          </div>
        </div>
        <div class="serve-right">
          <div class="seller">
            <p class="title">服务商</p>
            <img src="" alt="">
            <p></p>
            <div class="text">
              <p>成功接单<i></i></p>
              <p>接单率<i><%= receive%></i></p>
              <p>好评率<i><%= receive%></i></p>
            </div>
          </div>
          <div class="QR-code">
            <img src="img/join-2.png" alt="">
          </div>
        </div>
      </div>
    </div>
  </div>`


router.get('/', function (req, res, next) {
  var responseData = {}
  res.set('Access-Control-Allow-Origin', '*')
  responseData.services = serviceList
  res.send(responseData)
})

router.get('/serve', function (req, res, next) {
  var type = req.query.type? req.query.type: 'all'
  var classType = req.query.class
  var response = {result: []}
  if ('all'===type) {
    serves.forEach(serve => {
      if (serve.classType == classType){
        response.result.push(serve)
      }
    })
    res.send(response)
  } else {
    serves.forEach(serve => {
      if (serve.classType==classType){
        if (serve.type == type) {
          response.result.push(serve)
        }
      }
    })
    res.send(response)
  }
})

router.get('/detail', function (req, res, next) {
  res.set("Access-Control-Allow-Origin", "*")
  var detailID = +req.query.detailID
  console.log(detailID)
  var type = req.query.type
  var responseData = {}
  responseData.template = template
  // 处理返回数据
  serves.forEach(serve => {
    if(serve.detailID==detailID){
      responseData.data = serve
    }else {
      responseData.err = '网络错误'
    }
  })
  res.send(responseData)
})

module.exports = router;
